Autodesk.Revit.DB.OrdinateTextOrientation
The ordinate dimension text orientation.
Since:
2017 Subscription Update
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateTextOrientation.ParallelToWitnessLine
The dimension text orientation will be parallel to witness line.

Autodesk.Revit.DB.OrdinateTextOrientation.ParallelToDimensionLine
The dimension text orientation will be parallel to dimension line.